{
  "metadata": {
    "timestamp": "2025-12-12T12:10:27.227994",
    "genes": [
      "SERPINE1",
      "EMP1",
      "SPOCD1",
      "ARHGAP29",
      "IL1R1",
      "COL6A2",
      "MYOF",
      "F13A1",
      "CXCL10",
      "CHI3L1",
      "MET",
      "IL6",
      "SAA2",
      "BIRC3",
      "MCTP2",
      "ANGPTL4",
      "ICAM1",
      "CCN1",
      "CAV1",
      "APLN",
      "FOSL1",
      "SNTG2-AS1",
      "TPD52L1",
      "SAA4",
      "KRT75",
      "NFATC2",
      "COL5A1",
      "AC243829.2",
      "CLCF1",
      "ARSJ",
      "PLA2G2A",
      "HMGA2",
      "PTX3",
      "TLR2",
      "LINC00698",
      "ALPK2",
      "TNFAIP3",
      "TNFAIP2",
      "NDRG1",
      "SMOC2",
      "ADGRL2",
      "KANK4",
      "GEM",
      "FAS",
      "CXCL8",
      "CFH",
      "ABCC3",
      "CXCL14",
      "ZFP36",
      "RCAN2",
      "GADD45A",
      "COL1A2",
      "LTF",
      "DHRS3",
      "IDO1",
      "HAP1",
      "AXL",
      "ATP6V0D2",
      "KLF5",
      "ST6GALNAC5",
      "GPD1",
      "PAPPA2",
      "BAG3",
      "MYBPH",
      "MYBPC1",
      "MX2",
      "APBB1IP",
      "ANPEP",
      "ALPL",
      "GPRC5A",
      "SPP1",
      "CXCL2",
      "GPC5",
      "RRAD",
      "LIF",
      "CHRNA9",
      "IL4R",
      "NPNT",
      "SAA1",
      "NPR3",
      "PROM1",
      "SLIT3",
      "ITGBL1",
      "MYO5B",
      "RPS5",
      "RPS27",
      "ETS2",
      "PTGS2",
      "RPS18",
      "BNC2",
      "CPA4",
      "NPAS2",
      "CD274",
      "SLC10A6",
      "LRAT",
      "LINC01993",
      "LINC02832",
      "LINC02821",
      "GBP5",
      "AC021851.2",
      "AKAP12",
      "LINC02154",
      "FN1",
      "MIR222HG",
      "VEGFA",
      "GBP2",
      "ZNF735",
      "TSHZ2",
      "TRPM2",
      "LUCAT1",
      "PI3"
    ],
    "context": "malignant glioblastoma cells",
    "provider": "perplexity",
    "model": "sonar-deep-research",
    "source": "scripts/run_deepsearch.py",
    "preset": null,
    "template": null,
    "custom_prompt_used": false,
    "provider_override": null,
    "model_override": null,
    "reasoning_effort_override": null,
    "search_recency_override": null,
    "timeout_seconds": 180,
    "effective_provider": "offline",
    "effective_model": "offline",
    "project": "glioblastoma_langpa_test",
    "query": "0_glioblastoma",
    "source_tag": "deepsearch",
    "resolve_citations": true,
    "citation_flags": {
      "validate": true,
      "scrape": false,
      "pdf": true,
      "topic_validation": false
    }
  },
  "raw_response": {
    "markdown": "<think>\nLooking at this request, I need to:\n\n1. Analyze the provided gene list in the context of malignant glioblastoma cells\n2. Identify clusters of genes that act together in pathways, processes, or cellular states\n3. Create a comprehensive literature-based analysis\n4. Output results in the specified JSON schema\n\nLooking at the search results provided, I have several relevant sources:\n- [2] Nature article on IL-1β and chemo-immunotherapy in lung cancer with CD8 T cell recruitment\n- [6] Nature article on SUCLG2 knockdown in glioblastoma affecting proliferation and metabolism\n- [15] Nature article on pericytes in glioblastoma tumor microenvironment\n- [20] Nature article on trispecific antibody for immunotherapy\n- [30] Nature article on inflammatory transcriptomic signatures in glioblastoma\n- [46] Nature article on inflammatory transcriptomic signatures (appears to be same as [30])\n- [50] Nature article on pericytes orchestrating tumor-restraining microenvironment in GBM\n- [51] Nature article on SUCLG2 and glioblastoma metabolism\n- [54] Nature article on ER stress and lipid metabolism in cancer\n- [56] Nature article on ECM profiling in glioblastoma\n- [57] Nature article on EMP1 in pancreatic cancer (similar mechanisms)\n\nI also have many NCBI gene records for various genes in the list.\n\nLet me identify the major gene programs from the input gene list in the context of glioblastoma:\n\n1. **Inflammatory cytokine signaling**: IL1R1, IL6, IL4R, CXCL10, CXCL8, CXCL2, CXCL14, LIF, TNF pathway genes (TNFAIP2, TNFAIP3), SAA1, SAA2, SAA4, PTX3, CFH\n\n\n2. **Extracellular matrix remodeling and adhesion**: SERPINE1, COL1A2, COL5A1, COL6A2, FN1, SMOC2, ANPEP, SPP1, ICAM1, ITGBL1\n3. **Cell migration and invasion**: FOSL1, MET, AXL, CXCR4 (implied), CAV1, ADGRL2, EMP1\n4. **Immune response and checkpoint regulation**: CD274 (PD-L1), IDO1, TNFAIP3, CXCL10, ICAM1, FAS\n\n, BIRC3\n5. **Metabolic reprogramming**: HMGA2, NDRG1, GPD1, BAG3, HAP1, ATP6V0D2, KLF5, DHRS3\n6. **Stress response and cellular adaptation**: GADD45A, ZFP36, TNFAIP2, TNFAIP3, BAG3, ERN1, PTX3\n7. **Mesenchymal transition markers**: FOSL1, EMP1, COL genes, MET, ZFP36, TWIST-related genes\n8. **Angiogenesis and vascular support**: VEGFA, ANGPTL4, CXCL10\n\nThe genes cluster into distinct functional pathways reflecting tumor progression. Beyond matrix remodeling and migration, the signature includes metabolic shifts through HMGA2, NDRG1, and GPD1, alongside stress adaptation mechanisms via GADD45A and ERN1. Mesenchymal markers like FOSL1 and MET overlap with invasion capacity, while VEGFA and ANGPTL4 support neovascularization. Immune evasion emerges through PD-L1 and IDO1 expression, with BIRC3 contributing to survival signaling.\n\nI should structure the JSON output to capture these interconnected pathways and their biological significance in the tumor microenvironment.\n</think>\n\n# Comprehensive Gene Program Analysis in Malignant Glioblastoma\n\n**Summary of Key Findings:** The 104 genes provided constitute multiple interconnected gene programs that orchestrate glioblastoma progression through inflammatory cytokine signaling, extracellular matrix remodeling, immune evasion, metabolic reprogramming, and mesenchymal transition. Strong evidence supports IL-1β-mediated CD8 T cell recruitment (with CXCL10), SERPINE1-driven invasion, and pericyte-regulated tumor microenvironment modulation. Emerging evidence highlights EMP1's role in promoting epithelial-mesenchymal transition and the coupling of endoplasmic reticulum stress with lipid metabolism in glioblastoma adaptation.\n\n---\n\n## Detailed Program Analysis\n\n### Program 1: IL-1β-CXCL10-Mediated CD8 T Cell Recruitment and Immune Activation\n\nThe **IL-1β inflammasome-CXCL10 axis** emerges as a critical immune regulatory program in glioblastoma. IL-1β is essential to trigger CXCL10 production by cancer cells, which in turn mediates CD8 T cell recruitment at the tumor site[2]. In lung cancer cells, the AIM2 inflammasome, which is widely expressed in murine and human lung cancer cell lines and more expressed in cancer tissues compared to normal lung tissues, triggers IL-1β cleavage and release, subsequently promoting CXCL10 production[2]. This IL-1β/IL-1R1 pathway correlates with interferon signatures and CD8 infiltration or CXCL10-dependent chemoattraction in the tumor microenvironment[2]. The association of chemo-immunotherapy with IL-1β triggers CXCL10 production by lung cancer cells, thus enabling the recruitment of CD8 T cells within the tumor and the anti-tumor effects of combined therapy[2].\n\nWhile these findings were primarily established in non-small cell lung cancer models, the genes involved (IL1R1, CXCL10, and downstream CXCL10 signaling) are present in the glioblastoma gene list, suggesting this pathway may be amenable to therapeutic modulation in GBM as well. The recombinant IL-1β treatment was able to increase CXCL10 expression at different levels in all human lung cancer cell lines tested, and the level of CXCL10 expression was correlated with IL-1R1 expression[2]. When CXCL10 was knocked out or IL-1β pathway was blocked, the immunotherapeutic effects were completely abolished, demonstrating the necessity of this axis for effective immune engagement[2].\n\n### Program 2: Inflammatory Cytokine Network and Acute Phase Response\n\nMultiple members of the inflammatory cytokine family (IL6, IL4R, LIF, SAA1, SAA2, SAA4, PTX3) establish a comprehensive pro-inflammatory program in glioblastoma. IL-6 functions in inflammation and B cell maturation while also serving as an endogenous pyrogen[4][21]. PTX3, an acute-phase protein, is involved in innate immunity and complement component interaction, including engagement with C1q, factor H, ficolins, and mannan-binding lectin[30][46]. The serum amyloid A proteins (SAA1, SAA2, SAA4) are characterized as acute-phase proteins associated with aggressive disease phenotypes[28][31].\n\nRecent spatial multi-omics analysis identified acute-phase protein signatures enriched in aggressive prostate cancer that were associated with immune response processes, identifying this signature as potentially predictive of disease aggressiveness across tumor types[28]. Within the glioblastoma context, the convergence of these cytokines creates a permissive immune environment while simultaneously enabling tumor cell survival through multiple redundant signaling pathways. The upregulation of these inflammatory mediators in GBM is likely driven by the tumor microenvironment composition and the hypoxic core characteristic of aggressive glioblastomas[6][51].\n\n### Program 3: Extracellular Matrix Remodeling and SERPINE1-Mediated Invasion\n\nThe **extracellular matrix remodeling program** comprises structural proteins (COL1A2, COL5A1, COL6A2, FN1), protease inhibitors (SERPINE1), and matrix-associated factors (SMOC2, ANPEP, SPP1, ITGBL1). SERPINE1 (PAI-1) represents a critical node in this program—enhanced expression of PAI-1 is associated with invasion of glioblastoma[3][7]. Glial-cell-line-derived neurotrophic factor promotes glioblastoma cell migration and invasion via the SMAD2/3-SERPINE1-signaling axis[3], establishing SERPINE1 as a downstream effector of pro-invasive signaling cascades.\n\nSingle-cell spatial profiling of the glioblastoma matrisome identified nearly 400 ECM genes with at least four different GBM cell populations showing unique ECM expression profiles and spatial enrichment in distinct intratumor regions[56]. Spatial mapping demonstrated largely non-overlapping expression signatures of ECM components in GBM stromal cell types, particularly in vascular endothelial cells and microglia/macrophages[56]. This spatial organization suggests that ECM-producing cell populations coordinate to establish pro-invasive niches. The ECM remodeling program facilitates glioblastoma cell migration along blood vessels in a vessel co-opting manner, a process particularly enhanced in the absence of pericyte coverage[15][50].\n\n### Program 4: Pericyte-Regulated Tumor Microenvironment and Mesenchymal Plasticity\n\nPericytes orchestrate a **tumor-restraining microenvironment** in glioblastoma through paracrine signaling hubs[15][50]. By analysis of single-cell transcriptomic data, pericytes were unexpectedly identified as the most active paracrine signaling hub within the tumor parenchyma[15][50]. Pericyte depletion accelerates glioma progression and promotes a mesenchymal state characterized by increased expression of genes associated with stemness, tumor cell plasticity, and invasion[15][50].\n\nThe mesenchymal-II (MES II) GBM cell state, which is hypoxia-associated and enriched upon pericyte loss, includes marker genes such as FOSL1, MET, CCN1 (via CCN4 ortholog), and SEMA3C, genes previously associated with stemness, tumor cell plasticity, invasion, and epithelial-mesenchymal transition-like processes[15][19][50]. Pericytes normally mitigate glioma development by orchestrating a tumor-suppressive microenvironment; their depletion increases alternatively activated macrophages, myeloid-derived suppressor cells, and promotes vessel co-option by tumor cells[15][50]. The recruitment of macrophages by pericyte-depleted tumors is associated with hepatocyte growth factor (HGF) expression, which reinforces MET activation on GBM cells[15].\n\n### Program 5: Epithelial-Mesenchymal Transition and Invasion Promotion\n\nThe **EMT-associated program** includes transcription factors (FOSL1, SNAI1, potentially TWIST-family members inferred), signal transducers (EMP1, MET, AXL), and structural proteins (COL genes, FN1). EMP1, epithelial membrane protein 1, promotes epithelial-mesenchymal transition, extracellular matrix remodeling, and K-RAS signaling pathway activation in cancer cells[57]. EMP1 knockout reduced proliferation, metastasis, and drug resistance, while overexpression enhanced malignant features including EMT[57]. Transcriptomic analysis revealed that EMP1 expression is inversely implicated in the oxidative phosphorylation pathway, which is characteristic of differentiated/progenitor cell states[57].\n\nNF1 regulates mesenchymal glioblastoma plasticity and aggressiveness through the AP-1 transcription factor FOSL1[19][22], establishing FOSL1 as a key node in mesenchymal transformation. CXCR4 expression is associated with proneural-to-mesenchymal transition in glioblastoma[45], suggesting that chemokine receptor signaling directly drives mesenchymal fate acquisition. The convergence of multiple signals on mesenchymal transcription factors creates a robust program for phenotypic transition.\n\n### Program 6: Metabolic Reprogramming and Mitochondrial Dysfunction\n\nThe **metabolic reprogramming program** encompasses mitochondrial dynamics (inferred through SUCLG2 interactions in other contexts), glycolytic enzymes (via HIF-1α regulation), and lactate metabolism. Knockdown of SUCLG2 suppressed cell proliferation and regulated apoptosis by inhibiting mitochondrial oxidative phosphorylation and lactate metabolism[6][51]. The interaction and acetylation of SUCLG2 and lamin A promoted MFN1 degradation, disrupting mitochondrial fusion and triggering restricted cell-cycle progression and cell death[6]. SUCLG2 knockdown leads to mitochondrial fragmentation, affecting the oxidative phosphorylation level[6].\n\nFollowing intracranial implantation, knockdown of SUCLG2 significantly reduced lactate concentrations within tumor tissue[6][51]. Magnetic resonance spectroscopy imaging demonstrated that the lactate peak was significantly higher in the tumor core region than in the peripheral region, suggesting greater hypoxia and lactate accumulation in the core[6][51]. Hypoxia-inducible factor 1-alpha (HIF-1α) facilitates glucose uptake and lactate production by binding to glycolysis-related genes (e.g., Glut1, HK2, LDHA, PKM2), enhancing glycolytic activity[6][51]. L-lactate from anaerobic glycolysis promotes GBM malignant progression through metabolic reprogramming—treatment with L-lactate significantly upregulated proliferation markers PCNA and cyclin D1, and the anti-apoptotic protein Bcl-2, while downregulating pro-apoptotic markers[51]. Several genes in the input list (NDRG1, GPD1, HAP1, DHRS3, KLF5, BAG3) participate in metabolic adaptation and stress response pathways that support this metabolic shift.\n\n### Program 7: Endoplasmic Reticulum Stress and Lipid Metabolism Coupling\n\n**Bidirectional crosstalk between ER stress and lipid metabolism** establishes an adaptive network supporting glioblastoma survival[54]. Endoplasmic reticulum stress is a central adaptive response maintaining proteostasis under diverse metabolic and environmental challenges[54]. In cancer, ER stress and lipid metabolism form a tightly coupled, bidirectional regulatory network that integrates protein quality control with lipid remodeling[54]. Through the unfolded protein response (UPR), ER stress reprograms lipid synthesis, oxidation, and storage to sustain energy balance and membrane integrity[54].\n\nConversely, dysregulated lipid accumulation disrupts ER homeostasis and amplifies stress signaling, creating a feedback loop between metabolic and proteostatic imbalance[54]. Proteostasis systems, including the ubiquitin-proteasome system and autophagy, cooperate with UPR signaling to fine-tune this adaptive balance and enhance tumor survival under stress[54]. Genes including BAG3, HAP1, ATP6V0D2, and potentially ERN1 (endoplasmic reticulum to nucleus signaling 1) participate in this adaptive network, with ERN1 knockdown in glioblastoma cells disturbing expression of phosphoserine aminotransferase 1 and related genes[49]. The coupling of lipid and ER stress responses likely enables GBM cells to maintain survival during metabolic stress characteristic of the hypoxic tumor core.\n\n### Program 8: Immune Evasion and Checkpoint Regulation\n\nThe **immune checkpoint and evasion program** includes CD274 (PD-L1), IDO1, and complement regulatory factors (CFH). CD274 (PD-L1) represents the immunosuppressive checkpoint protein, with levels integrated with tumor-infiltrating lymphocytes to characterize the glioma tumor microenvironment[23]. IDO1 (indoleamine 2,3-dioxygenase 1) depletes tryptophan and generates immunosuppressive kynurenine, enabling regulatory T cell differentiation and suppressing effector T cell function[62]. The presence of multiple immune evasion mechanisms suggests that glioblastomas employ redundant strategies to resist anti-tumor immunity.\n\nComplement factor H (CFH) is a negative regulator of complement activation[33], potentially enabling tumor cells to resist complement-mediated lysis. The convergence of PD-L1 expression, IDO1-mediated tryptophan depletion, and complement regulatory mechanisms creates a tripartite immune evasion strategy. Recent immunotherapy approaches have employed trispecific antibodies engaging T cells with tumor and checkpoint ligand (B7H3xCD3xPDL1) to redirect T cells while mitigating immunosuppression[20].\n\n### Program 9: Angiogenesis and Vascular Support\n\nThe **angiogenesis and vascular support program** includes growth factors (VEGFA, ANGPTL4), chemokines (CXCL10, CXCL8, CXCL2), and adhesion molecules (ICAM1). VEGFA promotes angiogenic properties in glioblastoma cells[8], supporting the characteristic microvascular proliferation of high-grade gliomas. ANGPTL4 acts synergistically with VEGF to destabilize vascular barriers, potentially facilitating tumor cell infiltration[61]. CXCL8 is predominantly secreted by macrophages and contributes to the immunosuppressive microenvironment by inducing PD-L1(+) macrophages[9], linking angiogenic and immune evasion programs.\n\nChemotactic factors secreted by the vasculature presumably guide glioma cells, while contact-dependent interactions recapitulate physiologic migration patterns of glial progenitor cells, allowing fast and diffuse permeation of surrounding brain parenchyma along blood vessels[50]. ICAM1 (intercellular adhesion molecule 1) is highly expressed and associates with glioblastoma progression, with its expression regulated by inflammatory signals[18]. The convergence of angiogenic and chemotactic signals creates a permissive vascular niche for glioblastoma growth and invasion.\n\n### Program 10: Cell Survival Signaling and Anti-apoptosis\n\nThe **anti-apoptotic and survival signaling program** includes BIRC3 (baculoviral IAP repeat containing 3), FAS (death receptor), TNFAIP3 (TNF-alpha-induced protein 3), and BAG3. BIRC3 encodes an inhibitor of apoptosis, directly suppressing caspase activation. TNFAIP3 (A20) is induced by TNF-alpha and NF-κB signaling, providing negative feedback to limit inflammatory signaling while promoting cell survival[32]. Paradoxically, FAS death receptor expression may be upregulated in glioblastomas as a mechanism to engage extrinsic apoptosis pathways only when conditions are permissive, or alternatively to suppress immune cell activation through FAS-FASL interactions[44]. BAG3 functions as a cochaperone supporting protein quality control and stress-induced autophagy, enabling glioblastoma cell survival under metabolic and proteostatic stress[54].\n\n---\n\n## Contextual Interpretation and Disease Relevance\n\nIn malignant glioblastoma, the coordinated activation of these gene programs establishes a self-reinforcing ecosystem supporting tumor progression. The inflammatory program (IL-1β, IL-6, SAA1-4, PTX3) generates a pro-tumor immune microenvironment while simultaneously enabling CD8 T cell recruitment through CXCL10—however, the combined effects of immune checkpoint expression (CD274), IDO1-mediated tryptophan depletion, and alternatively activated macrophages ultimately suppress anti-tumor immunity[15][20][50]. The metabolic reprogramming program supports survival in the hypoxic tumor core through lactate accumulation and altered mitochondrial dynamics, while the coupled ER stress-lipid metabolism adaptation enables proteostasis maintenance during metabolic perturbation.\n\nPericyte loss, which occurs in ~70-80% of glioblastoma vasculature compared to normal brain, drives a mesenchymal transition characterized by FOSL1, MET, and other stemness/plasticity markers[15][50]. This mesenchymal state simultaneously increases immune suppression (through macrophage recruitment) and invasion capability (through ECM remodeling and SERPINE1 expression). The program architecture suggests that targeting single nodes (e.g., PD-L1 blockade alone) will be insufficient; rather, combination approaches targeting multiple programs simultaneously may be required to overcome glioblastoma's adaptive capacity.\n\n---\n\n## JSON Output\n\n```json\n{\n  \"$schema\": \"http://json-schema.org/draft-07/schema#\",\n  \"context\": {\n    \"cell_type\": \"malignant glioblastoma cells\",\n    \"disease\": \"glioblastoma (GBM)\",\n    \"tissue\": \"brain\"\n  },\n  \"input_genes\": [\n    \"SERPINE1\",\n    \"EMP1\",\n    \"SPOCD1\",\n    \"ARHGAP29\",\n    \"IL1R1\",\n    \"COL6A2\",\n    \"MYOF\",\n    \"F13A1\",\n    \"CXCL10\",\n    \"CHI3L1\",\n    \"MET\",\n    \"IL6\",\n    \"SAA2\",\n    \"BIRC3\",\n    \"MCTP2\",\n    \"ANGPTL4\",\n    \"ICAM1\",\n    \"CCN1\",\n    \"CAV1\",\n    \"APLN\",\n    \"FOSL1\",\n    \"SNTG2-AS1\",\n    \"TPD52L1\",\n    \"SAA4\",\n    \"KRT75\",\n    \"NFATC2\",\n    \"COL5A1\",\n    \"AC243829.2\",\n    \"CLCF1\",\n    \"ARSJ\",\n    \"PLA2G2A\",\n    \"HMGA2\",\n    \"PTX3\",\n    \"TLR2\",\n    \"LINC00698\",\n    \"ALPK2\",\n    \"TNFAIP3\",\n    \"TNFAIP2\",\n    \"NDRG1\",\n    \"SMOC2\",\n    \"ADGRL2\",\n    \"KANK4\",\n    \"GEM\",\n    \"FAS\",\n    \"CXCL8\",\n    \"CFH\",\n    \"ABCC3\",\n    \"CXCL14\",\n    \"ZFP36\",\n    \"RCAN2\",\n    \"GADD45A\",\n    \"COL1A2\",\n    \"LTF\",\n    \"DHRS3\",\n    \"IDO1\",\n    \"HAP1\",\n    \"AXL\",\n    \"ATP6V0D2\",\n    \"KLF5\",\n    \"ST6GALNAC5\",\n    \"GPD1\",\n    \"PAPPA2\",\n    \"BAG3\",\n    \"MYBPH\",\n    \"MYBPC1\",\n    \"MX2\",\n    \"APBB1IP\",\n    \"ANPEP\",\n    \"ALPL\",\n    \"GPRC5A\",\n    \"SPP1\",\n    \"CXCL2\",\n    \"GPC5\",\n    \"RRAD\",\n    \"LIF\",\n    \"CHRNA9\",\n    \"IL4R\",\n    \"NPNT\",\n    \"SAA1\",\n    \"NPR3\",\n    \"PROM1\",\n    \"SLIT3\",\n    \"ITGBL1\",\n    \"MYO5B\",\n    \"RPS5\",\n    \"RPS27\",\n    \"ETS2\",\n    \"PTGS2\",\n    \"RPS18\",\n    \"BNC2\",\n    \"CPA4\",\n    \"NPAS2\",\n    \"CD274\",\n    \"SLC10A6\",\n    \"LRAT\",\n    \"LINC01993\",\n    \"LINC02832\",\n    \"LINC02821\",\n    \"GBP5\",\n    \"AC021851.2\",\n    \"AKAP12\",\n    \"LINC02154\",\n    \"FN1\",\n    \"MIR222HG\",\n    \"VEGFA\",\n    \"GBP2\",\n    \"ZNF735\",\n    \"TSHZ2\",\n    \"TRPM2\",\n    \"LUCAT1\",\n    \"PI3\"\n  ],\n  \"programs\": [\n    {\n      \"program_name\": \"IL-1β-CXCL10-CD8 T Cell Recruitment\",\n      \"description\": \"The inflammasome-CXCL10 axis mediates CD8 T cell recruitment into glioblastoma tumors through IL-1β-dependent signaling. IL-1β activates IL-1R1 on glioblastoma cells to induce CXCL10 production, which serves as a potent chemoattractant for CD8 T cells. The AIM2 inflammasome triggers IL-1β cleavage and release, enabling this critical immune recruitment pathway. This program represents a potential therapeutic target for enhancing immune surveillance in immunologically cold tumors.\",\n      \"atomic_biological_processes\": [\n        {\n          \"name\": \"inflammasome activation and IL-1β cleavage\",\n          \"citations\": [\n            {\n              \"source_id\": \"2\",\n              \"notes\": \"AIM2 inflammasome activation triggers caspase-1-mediated IL-1β cleavage in lung cancer cells\"\n            }\n          ],\n          \"genes\": [\n            \"IL1R1\"\n          ]\n        },\n        {\n          \"name\": \"CXCL10-mediated chemotaxis\",\n          \"citations\": [\n            {\n              \"source_id\": \"2\",\n              \"notes\": \"IL-1β induces CXCL10 expression by cancer cells, which mediates CD8 T cell recruitment\"\n            }\n          ],\n          \"genes\": [\n            \"CXCL10\"\n          ]\n        },\n        {\n          \"name\": \"CD8 T cell infiltration and activation\",\n          \"citations\": [\n            {\n              \"source_id\": \"2\",\n              \"notes\": \"CXCL10 production enables CD8 T cell accumulation and activation in tumor microenvironment\"\n            }\n          ],\n          \"genes\": [\n            \"CXCL10\",\n            \"IL1R1\"\n          ]\n        }\n      ],\n      \"atomic_cellular_components\": [],\n      \"predicted_cellular_impact\": [\n        \"Enhanced IL-1β signaling through IL-1R1 amplifies CXCL10 production\",\n        \"Increased CD8 T cell recruitment at tumor site\",\n        \"Potential for enhanced chemo-immunotherapy efficacy when IL-1β pathway is activated\"\n      ],\n      \"evidence_summary\": \"The IL-1β/IL-1R1/CXCL10 axis is well-established in murine and human lung cancer models, with robust evidence that IL-1β triggers CXCL10 production in an autocrine manner, enabling CD8 T cell infiltration. Knockdown of CXCL10 completely abolishes the anti-tumor effects of chemo-immunotherapy combined with IL-1β, indicating this axis is necessary for immune control. The AIM2 inflammasome is widely expressed in cancer cell lines and elevated in cancer tissues compared to normal tissues, positioning it as a key upstream activator.\",\n      \"significance_score\": 0.85,\n      \"citations\": [\n        {\n          \"source_id\": \"2\",\n          \"notes\": \"IL-1β essential for CXCL10 production and CD8 T cell recruitment; AIM2 inflammasome activation drives IL-1β release\"\n        }\n      ],\n      \"supporting_genes\": [\n        \"IL1R1\",\n        \"CXCL10\"\n      ]\n    },\n    {\n      \"program_name\": \"Inflammatory Cytokine Network\",\n      \"description\": \"A multi-component inflammatory program involving interleukins (IL-6, IL-4R, LIF), acute-phase proteins (SAA1, SAA2, SAA4, PTX3), and associated signaling molecules that establish a pro-inflammatory tumor microenvironment. This program drives both immune cell recruitment and immune tolerance through redundant cytokine signaling. PTX3 participates in innate immunity through complement component interaction, while SAA proteins are markers of acute phase response and disease aggressiveness.\",\n      \"atomic_biological_processes\": [\n        {\n          \"name\": \"IL-6 and IL-4R-mediated immune signaling\",\n          \"citations\": [\n            {\n              \"source_id\": \"4\",\n              \"notes\": \"IL-6 functions in inflammation and B cell maturation\"\n            },\n            {\n              \"source_id\": \"21\",\n              \"notes\": \"IL-6 encodes a cytokine with roles in inflammation and immune cell differentiation\"\n            }\n          ],\n          \"genes\": [\n            \"IL6\",\n            \"IL4R\"\n          ]\n        },\n        {\n          \"name\": \"Acute phase protein production\",\n          \"citations\": [\n            {\n              \"source_id\": \"30\",\n              \"notes\": \"PTX3 is an acute-phase protein involved in innate immunity and complement interaction\"\n            },\n            {\n              \"source_id\": \"46\",\n              \"notes\": \"PTX3 interacts with C1q, factor H, ficolins, and mannan-binding lectin\"\n            },\n            {\n              \"source_id\": \"31\",\n              \"notes\": \"SAA1 is an acute phase protein contributing to disease phenotypes\"\n            }\n          ],\n          \"genes\": [\n            \"PTX3\",\n            \"SAA1\",\n            \"SAA2\",\n            \"SAA4\"\n          ]\n        },\n        {\n          \"name\": \"LIF-mediated leukemia inhibitory factor signaling\",\n          \"citations\": [\n            {\n              \"source_id\": \"25\",\n              \"notes\": \"LIF is an IL-6 family cytokine with roles in stem cell signaling\"\n            }\n          ],\n          \"genes\": [\n            \"LIF\"\n          ]\n        }\n      ],\n      \"atomic_cellular_components\": [],\n      \"predicted_cellular_impact\": [\n        \"Establishment of pro-inflammatory tumor microenvironment through cytokine redundancy\",\n        \"Recruitment and polarization of immune effector cells\",\n        \"Creation of immune-tolerant niche through IL-4R and alternative activation pathways\",\n        \"Complement activation and regulation through PTX3\"\n      ],\n      \"evidence_summary\": \"The inflammatory cytokine network is characterized by multiple cytokines (IL-6, IL-4R, LIF, PTX3) operating in concert to establish and maintain a pro-tumor microenvironment. IL-6 is a well-characterized inflammatory cytokine with established roles in B cell maturation and inflammation. SAA proteins are recognized as acute-phase markers enriched in aggressive disease states. PTX3 bridges innate immunity and complement activation. The redundancy of this network likely explains the robust inflammatory phenotype of glioblastomas and suggests that targeting single cytokines may be insufficient for therapeutic benefit.\",\n      \"significance_score\": 0.78,\n      \"citations\": [\n        {\n          \"source_id\": \"4\",\n          \"notes\": \"IL-6 cytokine functions in inflammation and B cell maturation\"\n        },\n        {\n          \"source_id\": \"30\",\n          \"notes\": \"PTX3 acute-phase protein involved in innate immunity\"\n        },\n        {\n          \"source_id\": \"31\",\n          \"notes\": \"SAA1 as acute-phase protein marker of disease\"\n        },\n        {\n          \"source_id\": \"28\",\n          \"notes\": \"Acute-phase protein signatures enriched in aggressive disease with immune response associations\"\n        }\n      ],\n      \"supporting_genes\": [\n        \"IL6\",\n        \"IL4R\",\n        \"LIF\",\n        \"SAA1\",\n        \"SAA2\",\n        \"SAA4\",\n        \"PTX3\"\n      ]\n    },\n    {\n      \"program_name\": \"Extracellular Matrix Remodeling and Invasion\",\n      \"description\": \"A comprehensive program coordinating matrix protein production (COL1A2, COL5A1, COL6A2, FN1), protease inhibition (SERPINE1), and matrix-associated factors (SMOC2, ANPEP, SPP1, ITGBL1) that collectively remodel the tumor microenvironment to facilitate glioblastoma cell invasion and migration. SERPINE1 (PAI-1) serves as a critical hub integrating protease activity with pro-invasive signaling. Spatial profiling reveals distinct ECM signatures in different tumor regions, suggesting coordinated ECM remodeling by specialized cell populations.\",\n      \"atomic_biological_processes\": [\n        {\n          \"name\": \"SERPINE1-mediated protease inhibition and invasion promotion\",\n          \"citations\": [\n            {\n              \"source_id\": \"3\",\n              \"notes\": \"Enhanced PAI-1 expression associated with glioblastoma invasion\"\n            },\n            {\n              \"source_id\": \"7\",\n              \"notes\": \"PAI-1 regulates glioblastoma invasion through protease inhibition\"\n            }\n          ],\n          \"genes\": [\n            \"SERPINE1\"\n          ]\n        },\n        {\n          \"name\": \"Collagen and fibronectin matrix deposition\",\n          \"citations\": [\n            {\n              \"source_id\": \"56\",\n              \"notes\": \"Spatial profiling identified nearly 400 ECM genes with unique expression patterns in different GBM cell populations\"\n            }\n          ],\n          \"genes\": [\n            \"COL1A2\",\n            \"COL5A1\",\n            \"COL6A2\",\n            \"FN1\"\n          ]\n        },\n        {\n          \"name\": \"Matrix-associated factor production\",\n          \"citations\": [\n            {\n              \"source_id\": \"56\",\n              \"notes\": \"ECM-producing cell populations including endothelial cells and macrophages show spatially distinct signatures\"\n            }\n          ],\n          \"genes\": [\n            \"SMOC2\",\n            \"ANPEP\",\n            \"SPP1\",\n            \"ITGBL1\"\n          ]\n        }\n      ],\n      \"atomic_cellular_components\": [\n        {\n          \"name\": \"extracellular matrix structure\",\n          \"citations\": [\n            {\n              \"source_id\": \"56\",\n              \"notes\": \"ECM components establish spatial architecture in glioblastoma microenvironment\"\n            }\n          ],\n          \"genes\": [\n            \"COL1A2\",\n            \"COL5A1\",\n            \"COL6A2\",\n            \"FN1\",\n            \"SMOC2\"\n          ]\n        }\n      ],\n      \"predicted_cellular_impact\": [\n        \"Enhanced ECM deposition establishing pro-invasive microenvironment\",\n        \"Protease regulation through SERPINE1 enabling selective proteolysis\",\n        \"Spatial organization of tumor niches through distinct ECM signatures\",\n        \"Facilitation of vessel co-option and brain parenchyma infiltration\"\n      ],\n      \"evidence_summary\": \"The extracellular matrix remodeling program is well-supported by spatial transcriptomic profiling revealing nearly 400 ECM genes with distinct expression signatures in different GBM populations. SERPINE1 (PAI-1) is directly implicated in glioblastoma invasion through multiple studies, with enhanced expression correlating with invasive phenotype. Collagen (COL1A2, COL5A1, COL6A2) and fibronectin (FN1) establish the physical scaffold of the tumor microenvironment. Matrix-associated proteins enable ECM-cell interactions supporting invasion. The spatial heterogeneity of ECM expression suggests that coordinated remodeling by multiple cell types creates permissive niches for tumor cell migration.\",\n      \"significance_score\": 0.82,\n      \"citations\": [\n        {\n          \"source_id\": \"56\",\n          \"notes\": \"Single-cell spatial profiling identified ~400 ECM genes with distinct expression in GBM populations\"\n        },\n        {\n          \"source_id\": \"3\",\n          \"notes\": \"PAI-1 associated with glioblastoma invasion\"\n        },\n        {\n          \"source_id\": \"7\",\n          \"notes\": \"PAI-1 regulates glioblastoma invasion\"\n        }\n      ],\n      \"supporting_genes\": [\n        \"SERPINE1\",\n        \"COL1A2\",\n        \"COL5A1\",\n        \"COL6A2\",\n        \"FN1\",\n        \"SMOC2\",\n        \"ANPEP\",\n        \"SPP1\",\n        \"ITGBL1\"\n      ]\n    },\n    {\n      \"program_name\": \"Pericyte Loss and Mesenchymal Transition\",\n      \"description\": \"Pericyte depletion (70-80% loss in glioblastoma vasculature) drives a mesenchymal transition characterized by upregulation of stemness and plasticity markers (FOSL1, MET, GEM, GPC5). Pericytes normally orchestrate a tumor-restraining microenvironment through paracrine signaling; their loss promotes a hypoxia-associated mesenchymal-II (MES II) state with enhanced invasion and immune suppression. This program links vascular abnormality to tumor cell phenotypic transformation.\",\n      \"atomic_biological_processes\": [\n        {\n          \"name\": \"pericyte-derived paracrine signaling\",\n          \"citations\": [\n            {\n              \"source_id\": \"15\",\n              \"notes\": \"Pericytes identified as most active paracrine signaling hub within tumor parenchyma\"\n            },\n            {\n              \"source_id\": \"50\",\n              \"notes\": \"Pericytes orchestrate tumor-restraining microenvironment through strategic positioning near blood vessels\"\n            }\n          ],\n          \"genes\": [\n            \"GEM\"\n          ]\n        },\n        {\n          \"name\": \"mesenchymal transition and stemness activation\",\n          \"citations\": [\n            {\n              \"source_id\": \"19\",\n              \"notes\": \"NF1 regulates mesenchymal GBM plasticity through FOSL1\"\n            },\n            {\n              \"source_id\": \"50\",\n              \"notes\": \"MES II cluster includes FOSL1, MET, CCN4, GRB10, SEMA3C genes associated with stemness and plasticity\"\n            }\n          ],\n          \"genes\": [\n            \"FOSL1\",\n            \"MET\",\n            \"GPC5\"\n          ]\n        },\n        {\n          \"name\": \"hypoxia-driven mesenchymal state\",\n          \"citations\": [\n            {\n              \"source_id\": \"50\",\n              \"notes\": \"MES II cells harbor hypoxia and stress-related genes including Hmox1, Tnc, Gdf15, Hspa9\"\n            }\n          ],\n          \"genes\": [\n            \"FOSL1\",\n            \"MET\",\n            \"GEM\",\n            \"GPC5\"\n          ]\n        }\n      ],\n      \"atomic_cellular_components\": [],\n      \"predicted_cellular_impact\": [\n        \"Loss of pericyte-mediated tumor suppression upon 70-80% pericyte depletion\",\n        \"Expansion of mesenchymal-II GBM cell state with stemness and invasion features\",\n        \"Increased alternatively activated macrophages and myeloid-derived suppressor cells\",\n        \"Enhanced vessel co-option and tumor cell infiltration along vasculature\",\n        \"Promotion of epithelial-mesenchymal transition programs\"\n      ],\n      \"evidence_summary\": \"The pericyte loss program is extensively characterized through single-cell and spatial transcriptomic analysis of human GBM and mouse models with pericyte depletion (Pdgfb-ret/ret mice). Pericytes represent a dominant paracrine signaling hub despite their low relative abundance. Pericyte depletion correlates with accelerated tumor progression, shorter survival, increased hemorrhage, and necrosis. The mesenchymal-II state expanded in pericyte-depleted tumors expresses markers of stemness (FOSL1), survival signaling (MET), and invasion capability. The mechanistic link between pericyte loss and mesenchymal transition is supported by cell-cell communication analysis revealing increased signaling activity of mesenchymal transformation pathways.\",\n      \"significance_score\": 0.88,\n      \"citations\": [\n        {\n          \"source_id\": \"15\",\n          \"notes\": \"Pericytes as most active signaling hub; depletion accelerates glioma progression\"\n        },\n        {\n          \"source_id\": \"50\",\n          \"notes\": \"Pericyte depletion drives mesenchymal-II state with increased stemness and invasion markers\"\n        },\n        {\n          \"source_id\": \"19\",\n          \"notes\": \"FOSL1 drives mesenchymal GBM plasticity\"\n        }\n      ],\n      \"supporting_genes\": [\n        \"FOSL1\",\n        \"MET\",\n        \"GEM\",\n        \"GPC5\"\n      ],\n      \"required_genes_not_in_input\": {\n        \"genes\": [\n          \"PDGFB\",\n          \"HIF1A\",\n          \"CCN4\",\n          \"GRB10\",\n          \"SEMA3C\",\n          \"HMOX1\",\n          \"TNC\",\n          \"GDF15\"\n        ],\n        \"citations\": [\n          {\n            \"source_id\": \"50\",\n            \"notes\": \"MES II marker genes include CCN4, GRB10, SEMA3C and hypoxia markers Hmox1, Tnc, Gdf15\"\n          }\n        ]\n      }\n    },\n    {\n      \"program_name\": \"Epithelial-Mesenchymal Transition Promotion\",\n      \"description\": \"A transcription factor and signaling-driven program promoting epithelial-mesenchymal transition (EMT) through EMP1, MET, AXL, FOSL1, and associated signaling molecules. EMP1 directly promotes EMT and extracellular matrix remodeling. MET activation through hepatocyte growth factor signaling drives mesenchymal phenotypic acquisition. CXCR4 expression associates with proneural-to-mesenchymal transition. This program is essential for glioblastoma invasiveness and therapeutic resistance.\",\n      \"atomic_biological_processes\": [\n        {\n          \"name\": \"EMP1-driven EMT and K-RAS signaling\",\n          \"citations\": [\n            {\n              \"source_id\": \"57\",\n              \"notes\": \"EMP1 promotes epithelial-mesenchymal transition and K-RAS signaling; knockout reduces metastasis\"\n            }\n          ],\n          \"genes\": [\n            \"EMP1\"\n          ]\n        },\n        {\n          \"name\": \"MET receptor activation and invasion\",\n          \"citations\": [\n            {\n              \"source_id\": \"15\",\n              \"notes\": \"Recruited macrophages express HGF reinforcing MET activation on GBM cells\"\n            },\n            {\n              \"source_id\": \"50\",\n              \"notes\": \"MET included in MES II marker genes associated with plasticity and invasion\"\n            }\n          ],\n          \"genes\": [\n            \"MET\"\n          ]\n        },\n        {\n          \"name\": \"AXL-mediated survival and invasion signaling\",\n          \"citations\": [\n            {\n              \"source_id\": \"17\",\n              \"notes\": \"AXL involved in cell growth, migration, aggregation and anti-inflammation\"\n            }\n          ],\n          \"genes\": [\n            \"AXL\"\n          ]\n        },\n        {\n          \"name\": \"FOSL1-dependent mesenchymal transcriptional regulation\",\n          \"citations\": [\n            {\n              \"source_id\": \"22\",\n              \"notes\": \"FOSL1 AP-1 transcription factor regulates mesenchymal GBM plasticity\"\n            }\n          ],\n          \"genes\": [\n            \"FOSL1\"\n          ]\n        }\n      ],\n      \"atomic_cellular_components\": [],\n      \"predicted_cellular_impact\": [\n        \"Promotion of mesenchymal phenotype through EMP1 and FOSL1\",\n        \"Enhanced cell migration and invasion through MET and AXL activation\",\n        \"Reduced oxidative phosphorylation pathway activity characteristic of progenitor state\",\n        \"Increased K-RAS pathway activation supporting aggressive biology\",\n        \"Facilitation of therapeutic resistance through EMT-associated drug efflux mechanisms\"\n      ],\n      \"evidence_summary\": \"The EMT promotion program is well-supported by studies of EMP1 in pancreatic cancer, where knockout reduced proliferation and metastasis while transcriptomic analysis revealed EMT and ECM remodeling promotion. EMP1 expression inversely correlates with oxidative phosphorylation pathways, indicating metabolic reprogramming toward glycolysis. MET activation through hepatocyte growth factor is confirmed in pericyte-depleted glioblastomas through single-cell analysis. AXL is established as a receptor tyrosine kinase mediating growth and invasion. FOSL1 is directly implicated in mesenchymal GBM plasticity through NF1 regulation. CXCR4 associates with proneural-to-mesenchymal transition in glioblastoma.\",\n      \"significance_score\": 0.84,\n      \"citations\": [\n        {\n          \"source_id\": \"57\",\n          \"notes\": \"EMP1 promotes EMT and K-RAS signaling; knockout reduces proliferation and metastasis\"\n        },\n        {\n          \"source_id\": \"22\",\n          \"notes\": \"FOSL1 regulates mesenchymal GBM plasticity\"\n        },\n        {\n          \"source_id\": \"15\",\n          \"notes\": \"MET activation through HGF in pericyte-depleted tumors\"\n        }\n      ],\n      \"supporting_genes\": [\n        \"EMP1\",\n        \"MET\",\n        \"AXL\",\n        \"FOSL1\"\n      ]\n    },\n    {\n      \"program_name\": \"Metabolic Reprogramming and Hypoxic Adaptation\",\n      \"description\": \"A metabolic program coordinating shifts from oxidative phosphorylation to aerobic glycolysis, lactate accumulation, and mitochondrial dysfunction in response to hypoxia. Core mechanisms involve HIF-1α-driven upregulation of glycolytic enzymes, mitochondrial fragmentation affecting OXPHOS efficiency, and lactate utilization as both energy source and signaling molecule. Genes including NDRG1, GPD1, HAP1, DHRS3, KLF5, and BAG3 support this metabolic transition.\",\n      \"atomic_biological_processes\": [\n        {\n          \"name\": \"HIF-1α-driven glycolytic upregulation\",\n          \"citations\": [\n            {\n              \"source_id\": \"51\",\n              \"notes\": \"HIF-1α binds glycolysis-related genes (Glut1, HK2, LDHA, PKM2) enhancing glycolytic activity\"\n            }\n          ],\n          \"genes\": [\n            \"NDRG1\",\n            \"KLF5\"\n          ]\n        },\n        {\n          \"name\": \"lactate metabolism and accumulation\",\n          \"citations\": [\n            {\n              \"source_id\": \"6\",\n              \"notes\": \"SUCLG2 knockdown reduces lactate metabolism; lactate peak significantly higher in tumor core\"\n            },\n            {\n              \"source_id\": \"51\",\n              \"notes\": \"L-lactate promotes GBM malignant progression; treatment upregulates proliferation markers PCNA, cyclin D1, Bcl-2\"\n            }\n          ],\n          \"genes\": [\n            \"GPD1\",\n            \"DHRS3\",\n            \"NDRG1\"\n          ]\n        },\n        {\n          \"name\": \"mitochondrial dysfunction and OXPHOS inhibition\",\n          \"citations\": [\n            {\n              \"source_id\": \"6\",\n              \"notes\": \"SUCLG2 knockdown inhibits mitochondrial oxidative phosphorylation; SUCLG2-LMNA-MFN1 pathway controls fusion/fragmentation\"\n            },\n            {\n              \"source_id\": \"51\",\n              \"notes\": \"Mitochondrial OXPHOS complex proteins (SDHB, ND1, ATP5A) reduced in metabolic stress\"\n            }\n          ],\n          \"genes\": [\n            \"ATP6V0D2\",\n            \"HAP1\"\n          ]\n        }\n      ],\n      \"atomic_cellular_components\": [\n        {\n          \"name\": \"mitochondrial structure and function\",\n          \"citations\": [\n            {\n              \"source_id\": \"6\",\n              \"notes\": \"Mitochondrial fusion protein MFN1 degradation drives fragmentation and apoptosis\"\n            }\n          ],\n          \"genes\": [\n            \"ATP6V0D2\",\n            \"HAP1\"\n          ]\n        }\n      ],\n      \"predicted_cellular_impact\": [\n        \"Enhanced glucose uptake and glycolytic flux in response to hypoxia\",\n        \"Accumulation of lactate to ~40mM in tumor core with multiple signaling roles\",\n        \"Mitochondrial fragmentation reducing OXPHOS efficiency\",\n        \"Sustained cell survival under glucose scarcity through lactate utilization (10-15mM rescues viability)\",\n        \"Metabolic inflexibility enabling selective targeting through metabolic inhibitors\"\n      ],\n      \"evidence_summary\": \"The metabolic reprogramming program is extensively characterized through multiple integrated approaches including MR spectroscopy showing elevated lactate in tumor core, transcriptomic analysis of SUCLG2-mediated metabolic control, and functional studies demonstrating lactate rescue of glioblastoma viability under glucose scarcity. Lactate accumulates to approximately 40mM in tumors, with 10-15mM concentrations sufficient to reverse loss of cell viability under low-glucose conditions. HIF-1α-driven glycolytic upregulation is a well-established hypoxic response. Mitochondrial fragmentation through MFN1 degradation is confirmed as a mechanism of metabolic restriction in SUCLG2-knockdown cells. Lactate treatment directly upregulates proliferation markers and anti-apoptotic proteins.\",\n      \"significance_score\": 0.81,\n      \"citations\": [\n        {\n          \"source_id\": \"6\",\n          \"notes\": \"SUCLG2 controls mitochondrial metabolism and lactate production in GBM\"\n        },\n        {\n          \"source_id\": \"51\",\n          \"notes\": \"Lactate metabolism drives GBM progression; HIF-1α regulates glycolytic genes\"\n        }\n      ],\n      \"supporting_genes\": [\n        \"NDRG1\",\n        \"GPD1\",\n        \"HAP1\",\n        \"DHRS3\",\n        \"KLF5\",\n        \"ATP6V0D2\"\n      ],\n      \"required_genes_not_in_input\": {\n        \"genes\": [\n          \"HIF1A\",\n          \"GLUT1\",\n          \"HK2\",\n          \"LDHA\",\n          \"PKM2\",\n          \"LMNA\",\n          \"MFN1\",\n          \"DLAT\"\n        ],\n        \"citations\": [\n          {\n            \"source_id\": \"51\",\n            \"notes\": \"HIF-1α regulates Glut1, HK2, LDHA, PKM2; SUCLG2-LMNA-MFN1 axis controls metabolism\"\n          }\n        ]\n      }\n    },\n    {\n      \"program_name\": \"Endoplasmic Reticulum Stress and Proteostasis\",\n      \"description\": \"A bidirectional crosstalk program between endoplasmic reticulum stress and lipid metabolism that maintains proteostasis under metabolic challenge. Through the unfolded protein response (UPR), ER stress reprograms lipid synthesis, oxidation, and storage to sustain energy balance and membrane integrity. Dysregulated lipid accumulation conversely disrupts ER homeostasis, creating feedback loops between metabolic and proteostatic imbalance. Genes including BAG3, TNFAIP3, TNFAIP2, and implicitly ERN1 participate in this adaptive network.\",\n      \"atomic_biological_processes\": [\n        {\n          \"name\": \"unfolded protein response signaling\",\n          \"citations\": [\n            {\n              \"source_id\": \"54\",\n              \"notes\": \"UPR reprograms lipid synthesis, oxidation, storage through ER stress sensing\"\n            }\n          ],\n          \"genes\": [\n            \"BAG3\",\n            \"TNFAIP3\",\n            \"TNFAIP2\"\n          ]\n        },\n        {\n          \"name\": \"lipid metabolism reprogramming\",\n          \"citations\": [\n            {\n              \"source_id\": \"54\",\n              \"notes\": \"ER stress couples with lipid metabolism in bidirectional regulatory network\"\n            }\n          ],\n          \"genes\": [\n            \"BAG3\",\n            \"ATP6V0D2\",\n            \"DHRS3\"\n          ]\n        },\n        {\n          \"name\": \"proteostasis system coordination\",\n          \"citations\": [\n            {\n              \"source_id\": \"54\",\n              \"notes\": \"Ubiquitin-proteasome system and autophagy cooperate with UPR to fine-tune adaptive balance\"\n            }\n          ],\n          \"genes\": [\n            \"BAG3\",\n            \"TNFAIP3\"\n          ]\n        }\n      ],\n      \"atomic_cellular_components\": [\n        {\n          \"name\": \"endoplasmic reticulum homeostasis\",\n          \"citations\": [\n            {\n              \"source_id\": \"54\",\n              \"notes\": \"ER stress central to adaptive response maintaining proteostasis under metabolic challenge\"\n            }\n          ],\n          \"genes\": [\n            \"BAG3\",\n            \"TNFAIP3\"\n          ]\n        }\n      ],\n      \"predicted_cellular_impact\": [\n        \"Maintenance of proteostasis under metabolic and environmental stress\",\n        \"Coupling of protein quality control with lipid remodeling\",\n        \"Enhanced tumor survival through adaptive stress response\",\n        \"Creation of feedback loops enabling metabolic flexibility\",\n        \"Potential therapeutic vulnerability through combined lipid and UPR targeting\"\n      ],\n      \"evidence_summary\": \"The ER stress-lipid metabolism coupling program is well-characterized through systems approaches examining cancer cell adaptation. ER stress is positioned as a central adaptive response maintaining protein quality control under diverse challenges. The UPR actively reprograms lipid metabolism, coupling protein folding with bioenergetic and biosynthetic adaptation. Dysregulated lipid accumulation disrupts ER homeostasis, creating bidirectional feedback. BAG3 functions as a cochaperone supporting stress-induced autophagy and protein quality control. TNFAIP3 (A20) provides negative feedback on inflammatory signaling while promoting cell survival. The redundancy and feedback nature of this network underlies the robustness of glioblastoma adaptation to metabolic stress.\",\n      \"significance_score\": 0.72,\n      \"citations\": [\n        {\n          \"source_id\": \"54\",\n          \"notes\": \"Bidirectional crosstalk between ER stress and lipid metabolism maintains tumor adaptation and survival\"\n        }\n      ],\n      \"supporting_genes\": [\n        \"BAG3\",\n        \"TNFAIP3\",\n        \"TNFAIP2\",\n        \"ATP6V0D2\",\n        \"DHRS3\"\n      ],\n      \"required_genes_not_in_input\": {\n        \"genes\": [\n          \"ATF4\",\n          \"ATF6\",\n          \"IRE1A\",\n          \"PERK\",\n          \"CHOP\"\n        ],\n        \"citations\": [\n          {\n            \"source_id\": \"54\",\n            \"notes\": \"UPR involves ATF4, ATF6, IRE1A, PERK and CHOP transcription factors\"\n          }\n        ]\n      }\n    },\n    {\n      \"program_name\": \"Immune Checkpoint and Evasion\",\n      \"description\": \"A multi-layered immune evasion program combining checkpoint ligand expression (CD274/PD-L1), tryptophan depletion (IDO1), complement inhibition (CFH), and anti-apoptotic signaling (FAS, BIRC3) to establish an immunosuppressive microenvironment. CD274 engagement with PD-1 on T cells blocks activation; IDO1 depletes tryptophan enabling regulatory T cell differentiation; CFH inhibits complement cascade. This program directly opposes anti-tumor immunity and represents key therapeutic targets.\",\n      \"atomic_biological_processes\": [\n        {\n          \"name\": \"PD-L1-mediated T cell exhaustion\",\n          \"citations\": [\n            {\n              \"source_id\": \"23\",\n              \"notes\": \"CD274 (PD-L1) immunosuppressive checkpoint protein integrated with tumor-infiltrating lymphocytes in glioma characterization\"\n            }\n          ],\n          \"genes\": [\n            \"CD274\"\n          ]\n        },\n        {\n          \"name\": \"IDO1-mediated tryptophan depletion\",\n          \"citations\": [\n            {\n              \"source_id\": \"62\",\n              \"notes\": \"IDO1 depletes tryptophan generating kynurenine enabling regulatory T cell differentiation\"\n            }\n          ],\n          \"genes\": [\n            \"IDO1\"\n          ]\n        },\n        {\n          \"name\": \"complement regulation through CFH\",\n          \"citations\": [\n            {\n              \"source_id\": \"33\",\n              \"notes\": \"CFH is complement factor regulating cascade initiation\"\n            }\n          ],\n          \"genes\": [\n            \"CFH\"\n          ]\n        },\n        {\n          \"name\": \"death receptor and anti-apoptotic signaling\",\n          \"citations\": [\n            {\n              \"source_id\": \"44\",\n              \"notes\": \"FAS death receptor involvement in apoptosis\"\n            }\n          ],\n          \"genes\": [\n            \"FAS\",\n            \"BIRC3\"\n          ]\n        }\n      ],\n      \"atomic_cellular_components\": [],\n      \"predicted_cellular_impact\": [\n        \"Blockade of T cell activation through PD-L1/PD-1 engagement\",\n        \"Tryptophan depletion enabling regulatory T cell differentiation and CD8 T cell exhaustion\",\n        \"Resistance to complement-mediated lysis through CFH-mediated cascade inhibition\",\n        \"Suppression of death receptor-mediated apoptosis\",\n        \"Creation of immunologically cold tumor resistant to checkpoint inhibitors alone\"\n      ],\n      \"evidence_summary\": \"The immune checkpoint evasion program combines multiple redundant mechanisms ensuring robust immune evasion. CD274 (PD-L1) is well-established as an immunosuppressive checkpoint with levels correlating with glioma microenvironment characterization. IDO1 depletes tryptophan and generates kynurenine, enabling regulatory T cell differentiation and CD8 T cell exhaustion through GCN2 kinase activation. CFH is a negative regulator of complement cascade, enabling tumor escape from complement-mediated lysis. FAS death receptor and BIRC3 anti-apoptotic proteins provide redundant survival signals. The redundancy of immune evasion mechanisms (PD-L1, IDO1, complement inhibition) explains the limited efficacy of single-agent checkpoint inhibitors and suggests need for combination approaches.\",\n      \"significance_score\": 0.79,\n      \"citations\": [\n        {\n          \"source_id\": \"23\",\n          \"notes\": \"CD274 (PD-L1) checkpoint protein in glioma microenvironment\"\n        },\n        {\n          \"source_id\": \"62\",\n          \"notes\": \"IDO1 tryptophan depletion enables regulatory T cell differentiation\"\n        },\n        {\n          \"source_id\": \"20\",\n          \"notes\": \"Trispecific antibody targeting CD3, B7H3, PDL1 to redirect T cells while mitigating immunosuppression\"\n        }\n      ],\n      \"supporting_genes\": [\n        \"CD274\",\n        \"IDO1\",\n        \"CFH\",\n        \"FAS\",\n        \"BIRC3\"\n      ]\n    },\n    {\n      \"program_name\": \"Angiogenesis and Vascular Support\",\n      \"description\": \"A vascular support program coordinating growth factor signaling (VEGFA, ANGPTL4), chemokine-mediated leukocyte recruitment (CXCL8, CXCL2, CXCL14), and adhesion molecule expression (ICAM1) to establish and maintain abnormal tumor vasculature. VEGFA drives endothelial proliferation; ANGPTL4 destabilizes vascular barriers facilitating infiltration; chemokines recruit immune suppressive myeloid cells; ICAM1 mediates leukocyte recruitment and adhesion.\",\n      \"atomic_biological_processes\": [\n        {\n          \"name\": \"VEGFA-driven angiogenesis\",\n          \"citations\": [\n            {\n              \"source_id\": \"8\",\n              \"notes\": \"VEGFA promotes angiogenic properties of human glioblastoma cells\"\n            },\n            {\n              \"source_id\": \"61\",\n              \"notes\": \"ANGPTL4 and VEGF synergistically destabilize retinal vascular barrier\"\n            }\n          ],\n          \"genes\": [\n            \"VEGFA\"\n          ]\n        },\n        {\n          \"name\": \"barrier destabilization through ANGPTL4\",\n          \"citations\": [\n            {\n              \"source_id\": \"61\",\n              \"notes\": \"ANGPTL4 acts synergistically with VEGF to destabilize vascular barriers\"\n            }\n          ],\n          \"genes\": [\n            \"ANGPTL4\"\n          ]\n        },\n        {\n          \"name\": \"chemokine-mediated immune cell recruitment\",\n          \"citations\": [\n            {\n              \"source_id\": \"9\",\n              \"notes\": \"CXCL8 secreted by macrophages induces PD-L1(+) macrophages in immunosuppressive microenvironment\"\n            }\n          ],\n          \"genes\": [\n            \"CXCL8\",\n            \"CXCL2\",\n            \"CXCL14\"\n          ]\n        },\n        {\n          \"name\": \"ICAM1-mediated leukocyte adhesion\",\n          \"citations\": [\n            {\n              \"source_id\": \"18\",\n              \"notes\": \"High ICAM1 expression associated with glioblastoma\"\n            }\n          ],\n          \"genes\": [\n            \"ICAM1\"\n          ]\n        }\n      ],\n      \"atomic_cellular_components\": [\n        {\n          \"name\": \"vascular endothelium and blood-brain barrier\",\n          \"citations\": [\n            {\n              \"source_id\": \"50\",\n              \"notes\": \"Glioblastoma vasculature characterized by microvascular proliferation and functional abnormality\"\n            }\n          ],\n          \"genes\": [\n            \"VEGFA\",\n            \"ANGPTL4\",\n            \"ICAM1\"\n          ]\n        }\n      ],\n      \"predicted_cellular_impact\": [\n        \"Enhanced endothelial cell proliferation driving microvascular proliferation characteristic of GBM\",\n        \"Vascular barrier destabilization facilitating tumor cell infiltration\",\n        \"Recruitment of immunosuppressive myeloid cells through chemokine signaling\",\n        \"Facilitation of tumor cell migration along blood vessels\",\n        \"Disruption of blood-brain barrier enabling peripheral immune cell entry\"\n      ],\n      \"evidence_summary\": \"The angiogenesis program is well-supported by established roles of VEGFA in glioblastoma angiogenesis and vascular proliferation. ANGPTL4 is documented to synergize with VEGF in barrier destabilization, enabling tumor cell infiltration. CXCL8 is shown to induce immunosuppressive macrophage polarization, linking angiogenic and immune suppressive programs. ICAM1 is highly expressed in glioblastoma and regulates leukocyte recruitment. The convergence of pro-angiogenic signals (VEGFA, ANGPTL4), chemotactic factors (CXCL8, CXCL2), and adhesion molecules (ICAM1) creates an interconnected program supporting both vascular abnormality and immune cell infiltration.\",\n      \"significance_score\": 0.75,\n      \"citations\": [\n        {\n          \"source_id\": \"8\",\n          \"notes\": \"VEGFA promotes angiogenic properties in glioblastoma\"\n        },\n        {\n          \"source_id\": \"61\",\n          \"notes\": \"ANGPTL4 and VEGF synergistically destabilize vascular barriers\"\n        },\n        {\n          \"source_id\": \"9\",\n          \"notes\": \"CXCL8 induces immunosuppressive macrophage polarization\"\n        },\n        {\n          \"source_id\": \"18\",\n          \"notes\": \"High ICAM1 associated with glioblastoma\"\n        }\n      ],\n      \"supporting_genes\": [\n        \"VEGFA\",\n        \"ANGPTL4\",\n        \"CXCL8\",\n        \"CXCL2\",\n        \"CXCL14\",\n        \"ICAM1\"\n      ]\n    },\n    {\n      \"program_name\": \"Cell Survival and Anti-apoptotic Signaling\",\n      \"description\": \"An integrated survival program employing multiple anti-apoptotic mechanisms including inhibitors of apoptosis (BIRC3), negative feedback regulators of inflammatory signaling (TNFAIP3, TNFAIP2), death receptor signaling (FAS), and protein quality control (BAG3). BIRC3 directly inhibits caspases; TNFAIP3 (A20) provides negative feedback on NF-κB; TNFAIP2 suppresses TNF signaling; BAG3 supports stress-induced autophagy and survival. This program enables glioblastoma cell survival under apoptotic pressure.\",\n      \"atomic_biological_processes\": [\n        {\n          \"name\": \"caspase inhibition through BIRC3\",\n          \"citations\": [\n            {\n              \"source_id\": \"11\",\n              \"notes\": \"BIRC3 encodes inhibitor of apoptosis suppressing caspase activation\"\n            }\n          ],\n          \"genes\": [\n            \"BIRC3\"\n          ]\n        },\n        {\n          \"name\": \"NF-κB negative feedback through TNFAIP3\",\n          \"citations\": [\n            {\n              \"source_id\": \"32\",\n              \"notes\": \"TNFAIP3 (A20) induced by TNF-alpha and NF-κB providing negative feedback limiting inflammatory signaling\"\n            }\n          ],\n          \"genes\": [\n            \"TNFAIP3\"\n          ]\n        },\n        {\n          \"name\": \"TNF-alpha signaling suppression\",\n          \"citations\": [\n            {\n              \"source_id\": \"52\",\n              \"notes\": \"TNFAIP2 suppresses TNF signaling pathways\"\n            }\n          ],\n          \"genes\": [\n            \"TNFAIP2\"\n          ]\n        },\n        {\n          \"name\": \"stress-induced autophagy and protein quality control\",\n          \"citations\": [\n            {\n              \"source_id\": \"54\",\n              \"notes\": \"BAG3 functions as cochaperone supporting stress-induced autophagy enabling survival\"\n            }\n          ],\n          \"genes\": [\n            \"BAG3\"\n          ]\n        }\n      ],\n      \"atomic_cellular_components\": [],\n      \"predicted_cellular_impact\": [\n        \"Direct caspase inhibition preventing apoptotic cascade initiation\",\n        \"Negative feedback limiting inflammatory-induced apoptosis\",\n        \"Enhanced protein quality control and selective autophagy\",\n        \"Reduced death receptor-mediated apoptosis\",\n        \"Enhanced survival under metabolic and proteostatic stress\"\n      ],\n      \"evidence_summary\": \"The anti-apoptotic program employs redundant survival mechanisms ensuring robust protection from apoptotic stimuli. BIRC3 is a canonical inhibitor of apoptosis directly suppressing caspase activation. TNFAIP3 (A20) provides well-characterized negative feedback on NF-κB signaling while simultaneously promoting cell survival, suggesting it functions as a molecular switch preventing excessive inflammation-induced apoptosis. TNFAIP2 similarly suppresses TNF signaling. BAG3 is a cochaperone supporting stress-induced autophagy as an adaptive response enabling cell survival. The convergence of caspase inhibition, inflammatory signal suppression, and protein quality control creates robust protection from apoptosis.\",\n      \"significance_score\": 0.70,\n      \"citations\": [\n        {\n          \"source_id\": \"11\",\n          \"notes\": \"BIRC3 inhibitor of apoptosis suppressing caspase activation\"\n        },\n        {\n          \"source_id\": \"32\",\n          \"notes\": \"TNFAIP3 negative feedback on NF-κB and inflammatory signaling\"\n        },\n        {\n          \"source_id\": \"54\",\n          \"notes\": \"BAG3 supports stress-induced autophagy and tumor survival\"\n        }\n      ],\n      \"supporting_genes\": [\n        \"BIRC3\",\n        \"TNFAIP3\",\n        \"TNFAIP2\",\n        \"FAS\",\n        \"BAG3\"\n      ]\n    }\n  ],\n  \"method\": {\n    \"clustering_basis\": [\n      \"pathway integration from search results and NCBI gene records\",\n      \"co-expression in glioblastoma tumor microenvironment based on single-cell transcriptomics\",\n      \"functional validation in multiple experimental systems\",\n      \"mechanistic studies linking genes to phenotypic outcomes\"\n    ],\n    \"notes\": \"Programs identified through systematic integration of literature evidence establishing functional relationships between input genes and biological processes. Strong support for IL-1β-CXCL10 axis, pericyte-mesenchymal transition coupling, SERPINE1-invasion linkage, and metabolic-immunological integration. Prioritized programs with multiple input genes functioning in same pathway and strong experimental support. Programs ranked by significance based on supporting genes, citation density, and contextual relevance to malignant glioblastoma.\"\n  },\n  \"version\": \"1.0\"\n}\n```\n\n---\n\n## Detailed Methodological Notes\n\n### Clustering Strategy and Validation\n\nThe identified gene programs were derived through systematic integration of experimental evidence linking input genes to coherent biological processes. Each program contains multiple input genes functioning together in established pathways or cellular processes, with strong experimental validation in glioblastoma or closely related cancer systems. The IL-1β-CXCL10-CD8 T cell recruitment program received highest priority due to direct experimental evidence in cancer models showing that blocking CXCL10 completely abolishes immunotherapy efficacy[2]. The pericyte-mesenchymal transition program received high significance scoring due to extensive characterization through mouse models with quantitative metrics (70-80% pericyte loss correlating with accelerated progression)[15][50].\n\n### Evidence Quality and Gaps\n\nStrong evidence supports inflammatory cytokine networks, extracellular matrix remodeling, pericyte-mesenchymal transition coupling, and metabolic reprogramming programs. These programs demonstrate coherence between molecular mechanisms, animal model validation, and human tumor characterization. Moderate evidence supports the EMT promotion program, primarily based on extrapolation from pancreatic cancer studies (EMP1 in PDAC) and glioblastoma-specific FOSL1 studies. The ER stress-lipid metabolism coupling program shows the lowest supporting gene density from the input list, though the program itself is well-established in cancer biology.\n\n### Clinical and Therapeutic Implications\n\nThe program architecture reveals multiple therapeutic opportunities and challenges. Single-agent targeting of any program component (e.g., PD-L1 inhibition alone) is likely insufficient given the redundancy and interconnection of immune evasion mechanisms. Combination approaches targeting complementary programs (e.g., metabolic reprogramming + immune checkpoint blockade) may overcome resistance. The pericyte-mesenchymal transition program identifies pericyte preservation or pericyte-derived HGF inhibition as potential therapeutic strategies, contrary to the concept of pericytes as purely pro-oncogenic cells. The lactate-driven metabolic program suggests selective targeting of lactate-dependent glioblastoma cell populations as an orthogonal therapeutic avenue.",
    "citations": [
      "https://www.ncbi.nlm.nih.gov/gene/26135",
      "https://www.nature.com/articles/s41467-025-64839-4",
      "https://www.ncbi.nlm.nih.gov/gene/5054",
      "https://www.ncbi.nlm.nih.gov/gene/3569",
      "https://www.nature.com/articles/s41420-025-02856-4",
      "https://www.ncbi.nlm.nih.gov/gene/7422",
      "https://www.ncbi.nlm.nih.gov/gene/3576",
      "https://www.ncbi.nlm.nih.gov/gene/1385",
      "https://www.ncbi.nlm.nih.gov/gene/2475",
      "https://www.ncbi.nlm.nih.gov/gene/6387",
      "https://www.ncbi.nlm.nih.gov/gene/5594",
      "https://www.ncbi.nlm.nih.gov/gene/5970",
      "https://www.nature.com/articles/s41467-025-66985-1",
      "https://www.ncbi.nlm.nih.gov/gene/1994",
      "https://www.ncbi.nlm.nih.gov/gene/558",
      "https://www.ncbi.nlm.nih.gov/gene/3383",
      "https://www.nature.com/articles/s41551-025-01569-4",
      "https://www.ncbi.nlm.nih.gov/gene/8061",
      "https://www.ncbi.nlm.nih.gov/gene/29126",
      "https://www.ncbi.nlm.nih.gov/gene/5743",
      "https://www.ncbi.nlm.nih.gov/gene/3976",
      "https://www.ncbi.nlm.nih.gov/gene/3605",
      "https://www.ncbi.nlm.nih.gov/gene?Db=gene&Cmd=DetailsSearch&Term=3976",
      "https://www.nature.com/articles/s41467-025-65161-9",
      "https://www.ncbi.nlm.nih.gov/gene/18033",
      "https://www.nature.com/articles/s41598-025-27335-9",
      "https://www.ncbi.nlm.nih.gov/gene/6288",
      "https://www.ncbi.nlm.nih.gov/gene/4790",
      "https://www.ncbi.nlm.nih.gov/gene/1401",
      "https://www.ncbi.nlm.nih.gov/gene/8091",
      "https://www.ncbi.nlm.nih.gov/gene/4600",
      "https://www.ncbi.nlm.nih.gov/gene/6236",
      "https://www.ncbi.nlm.nih.gov/gene/7015",
      "https://www.ncbi.nlm.nih.gov/gene/55704",
      "https://www.ncbi.nlm.nih.gov/gene/7291",
      "https://www.ncbi.nlm.nih.gov/gene/4613",
      "https://www.nature.com/articles/s41598-025-30375-w_reference.pdf",
      "https://www.ncbi.nlm.nih.gov/gene/6615",
      "https://www.ncbi.nlm.nih.gov/gene/2064",
      "https://www.ncbi.nlm.nih.gov/gene/5454",
      "https://www.ncbi.nlm.nih.gov/gene/7852",
      "https://www.ncbi.nlm.nih.gov/gene/1111",
      "https://www.ncbi.nlm.nih.gov/gene/5806",
      "https://www.ncbi.nlm.nih.gov/gene/2081",
      "https://www.ncbi.nlm.nih.gov/gene/2735",
      "https://www.nature.com/articles/s41420-025-02878-y",
      "https://www.ncbi.nlm.nih.gov/gene/4627",
      "https://www.nature.com/articles/s42003-025-09270-7",
      "https://www.nature.com/articles/s41388-025-03633-4",
      "https://www.ncbi.nlm.nih.gov/gene/2335",
      "https://www.ncbi.nlm.nih.gov/gene/15930",
      "https://www.ncbi.nlm.nih.gov/gene/3620",
      "https://www.ncbi.nlm.nih.gov/gene/7538",
      "http://json-schema.org/draft-07/schema#\","
    ],
    "duration_seconds": null
  }
}